Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-react-component_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: This page contains a detailed API reference for the React component class definition.
ja: このページには React コンポーネントクラス定義の詳細な API リファレンスがあります。

source: It assumes you're familiar with fundamental React concepts, such as [Components and Props](/docs/components-and-props.html), as well as [State and Lifecycle](/docs/state-and-lifecycle.html).
ja: また、あなたが [コンポーネントや props](/docs/components-and-props.html) などの基本的な React の概念、および [state やライフサイクル](/docs/state-and-lifecycle.html)に精通していることを前提としています。

source: If you're not, read them first.
ja: そうでない場合は、まずそれらを読んでください。

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: React lets you define components as classes or functions.
ja: React では、コンポーネントをクラスまたは関数として定義できます。

source: Components defined as classes currently provide more features which are described in detail on this page.
ja: クラスとして定義されたコンポーネントは現在このページで詳細に説明されているより多くの機能を提供します。

source: To define a React component class, you need to extend `React.Component`:
ja: React コンポーネントクラスを定義するには、`React.Component` を継承する必要があります。

source: The only method you *must* define in a `React.Component` subclass is called [`render()`](#render).
ja: `React.Component` サブクラスで*必ず*定義しなければならない唯一のメソッドは [`render()`](#render) です。

source: All the other methods described on this page are optional.
ja: このページで説明されている他のすべてのメソッドは任意です。

source: **We strongly recommend against creating your own base component classes.
ja: **独自の基底コンポーネントクラスを作成しないことを強くおすすめします。

source: ** In React components, [code reuse is primarily achieved through composition rather than inheritance](/docs/composition-vs-inheritance.html).
ja: **React コンポーネントでは、[コードの再利用は主に継承ではなく合成によって行われます](/docs/composition-vs-inheritance.html)。

source: >Note: > >React doesn't force you to use the ES6 class syntax.
ja: >補足: > >React は ES6 クラスの構文を使うことを強制していません。

source: If you prefer to avoid it, you may use the `create-react-class` module or a similar custom abstraction instead.
ja: 回避したい場合は、代わりに `create-react-class` モジュールまたは、同様の独自の抽象化を使用できます。

source: Take a look at [Using React without ES6](/docs/react-without-es6.html) to learn more.
ja: 詳しくは、[Using React without ES6](/docs/react-without-es6.html) をご覧ください。

source: ### The Component Lifecycle {#the-component-lifecycle}
ja: ### コンポーネントライフサイクル {#the-component-lifecycle}

source: Each component has several "lifecycle methods" that you can override to run code at particular times in the process.
ja: 各コンポーネントには、処理の過程の特定の時点でコードを実行するためにオーバーライドできるいくつかの「ライフサイクルメソッド」があります。

source: **You can use [this lifecycle diagram](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/) as a cheat sheet.
ja: **この[ライフサイクル図](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/)をチートシートとして使用できます。

source: ** In the list below, commonly used lifecycle methods are marked as **bold**.
ja: **以下のリストでは、よく使われるライフサイクルメソッドは**太字**で表示されています。

source: The rest of them exist for relatively rare use cases.
ja: それらの残りは比較的まれなユースケースのために存在します。

source: #### Mounting {#mounting}
ja: #### マウント {#mounting}

source: These methods are called in the following order when an instance of a component is being created and inserted into the DOM:
ja: コンポーネントのインスタンスが作成されて DOM に挿入されるときに、これらのメソッドが次の順序で呼び出されます。

source: >Note: > >These methods are considered legacy and you should [avoid them](/blog/2018/03/27/update-on-async-rendering.html) in new code:
ja: >補足: > >これらのメソッドはレガシーだと考えられているため、新しいコードでは[避ける](/blog/2018/03/27/update-on-async-rendering.html)べきです。

source: #### Updating {#updating}
ja: #### 更新 {#updating}

source: An update can be caused by changes to props or state.
ja: 更新は props や state の変更によって発生する可能性があります。

source: These methods are called in the following order when a component is being re-rendered:
ja: コンポーネントが再レンダーされるときに、これらのメソッドは次の順序で呼び出されます。

source: #### Unmounting {#unmounting}
ja: #### アンマウント {#unmounting}

source: This method is called when a component is being removed from the DOM:
ja: このメソッドは、コンポーネントが DOM から削除されるときに呼び出されます。

source: #### Error Handling {#error-handling}
ja: #### エラーハンドリング {#error-handling}

source: These methods are called when there is an error during rendering, in a lifecycle method, or in the constructor of any child component.
ja: これらのメソッドは任意の子コンポーネントのレンダー中、ライフサイクルメソッド内、またはコンストラクタ内でエラーが発生したときに呼び出されます。

source: ### Other APIs {#other-apis}
ja: ### 他の API {#other-apis}

source: Each component also provides some other APIs:
ja: 各コンポーネントはその他にもいくつかの API を提供します。

source: ### Class Properties {#class-properties}
ja: ### クラスプロパティ {#class-properties}

source: ### Instance Properties {#instance-properties}
ja: ### インスタンスプロパティ {#instance-properties}

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: ### Commonly Used Lifecycle Methods {#commonly-used-lifecycle-methods}
ja: ### よく使われるライフサイクルメソッド {#commonly-used-lifecycle-methods}

source: The methods in this section cover the vast majority of use cases you'll encounter creating React components.
ja: このセクションのメソッドは、React コンポーネントを作成する際に遭遇する大部分のユースケースを網羅しています。

source: **For a visual reference, check out [this lifecycle diagram](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/).**
ja: 視覚的なリファレンスとして、この[ライフサイクル図](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/)もチェックしてみてください。

source: The `render()` method is the only required method in a class component.
ja: `render()` メソッドは、クラスコンポーネントで必ず定義しなければならない唯一のメソッドです。

source: When called, it should examine `this.props` and `this.state` and return one of the following types:
ja: 呼び出されると、`this.props` と `this.state` を調べて、次のいずれかの型を返します。

source: - **React elements.** Typically created via [JSX](/docs/introducing-jsx.html).
ja: - **React 要素** 通常は [JSX](/docs/introducing-jsx.html) 経由で作成されます。

source: For example, `<div />` and `<MyComponent />` are React elements that instruct React to render a DOM node, or another user-defined component, respectively.
ja: 例えば、`<div />` や `<MyComponent />` はそれぞれ React に DOM ノードやユーザが定義した他のコンポーネントをレンダーするように指示する React 要素です

source: - **Arrays and fragments.** Let you return multiple elements from render.
ja: - **配列とフラグメント** 複数の要素を `render()` から返します。

source: See the documentation on [fragments](/docs/fragments.html) for more details.
ja: 詳しくは [フラグメント](/docs/fragments.html) を参照してください

source: - **Portals**.
ja: - **ポータル

source: Let you render children into a different DOM subtree.
ja: ** 子を異なる DOM サブツリーにレンダーします。

source: See the documentation on [portals](/docs/portals.html) for more details.
ja: 詳しくは [ポータル](/docs/portals.html) を参照してください

source: - **String and numbers.
ja: - **文字列と数値

source: ** These are rendered as text nodes in the DOM.
ja: ** これは DOM のテキストノードとしてレンダーされます

source: - **Booleans or `null`**.
ja: - **真偽値または `null`

source: Render nothing.
ja: ** 何もレンダーしません。

source: (Mostly exists to support `return test && <Child />` pattern, where `test` is boolean.)
ja: (ほとんどの場合、`return test && <Child />` パターンをサポートするために存在しています。ここで、`test` は真偽値です）

source: The `render()` function should be pure, meaning that it does not modify component state, it returns the same result each time it's invoked, and it does not directly interact with the browser.
ja: `render()` 関数は「純粋」でなければなりません。つまり、コンポーネントの state を変更せず、呼び出されるたびに同じ結果を返し、ブラウザと直接対話しないということです。

source: If you need to interact with the browser, perform your work in `componentDidMount()` or the other lifecycle methods instead.
ja: ブラウザと対話する必要がある場合は、代わりに `componentDidMount()` や他のライフサイクルメソッドで行います。

source: Keeping `render()` pure makes components easier to think about.
ja: `render()` を純粋にしておくことで、コンポーネントについて考えやすくなります。

source: > Note > > `render()` will not be invoked if [`shouldComponentUpdate()`](#shouldcomponentupdate) returns false.
ja: > 補足 > > [`shouldComponentUpdate()`](#shouldcomponentupdate) が false を返した場合、`render()` は呼び出されません。

source: **If you don't initialize state and you don't bind methods, you don't need to implement a constructor for your React component.**
ja: **state の初期化もメソッドのバインドもしないのであれば、React コンポーネントのコンストラクタを実装する必要はありません。**

source: The constructor for a React component is called before it is mounted.
ja: React コンポーネントのコンストラクタは、マウントされる前に呼び出されます。

source: When implementing the constructor for a `React.Component` subclass, you should call `super(props)` before any other statement.
ja: `React.Component` サブクラスのコンストラクタを実装するときは、他の文の前に `super(props)` を呼び出す必要があります。

source: Otherwise, `this.props` will be undefined in the constructor, which can lead to bugs.
ja: そうでなければ、`this.props` はコンストラクタ内で未定義になり、バグの原因となる可能性があります。

source: Typically, in React constructors are only used for two purposes:
ja: 通常、React では、コンストラクタは 2 つの目的にのみ使用されます。

source: * Initializing [local state](/docs/state-and-lifecycle.html) by assigning an object to `this.state`.
ja: * `this.state` にオブジェクトを代入して [ローカル state](/docs/state-and-lifecycle.html) を初期化すること

source: * Binding [event handler](/docs/handling-events.html) methods to an instance.
ja: * [イベントハンドラ](/docs/handling-events.html) をインスタンスにバインドすること

source: You **should not call `setState()`** in the `constructor()`.
ja: `constructor()` の中で **`setState()` を呼び出さないでください**。

source: Instead, if your component needs to use local state, **assign the initial state to `this.state`** directly in the constructor:
ja: 代わりに、コンポーネントがローカル state を使用する必要がある場合は、コンストラクタで直接 **`this.state` に初期状態を割り当てます**。

source: // Don't call this.setState() here!
ja: // ここで this.setState() を呼び出さないでください

source: Constructor is the only place where you should assign `this.state` directly.
ja: コンストラクタは、`this.state` を直接代入する唯一の場所です。

source: In all other methods, you need to use `this.setState()` instead.
ja: 他のすべてのメソッドでは、代わりに `this.setState()` を使う必要があります。

source: Avoid introducing any side-effects or subscriptions in the constructor.
ja: コンストラクタに副作用や購読を導入しないでください。

source: For those use cases, use `componentDidMount()` instead.
ja: そのような場合は、代わりに `componentDidMount()` を使用してください。

source: >Note > >**Avoid copying props into state!
ja: >補足 > >**props を state にコピーしないでください。

source: This is a common mistake:** > >```js >constructor(props) { > super(props); > // Don't do this!
ja: これはよくある間違いです。** > >```js >constructor(props) { > super(props); > // してはいけません

source: > this.state = { color: props.color }; >} >``` > >The problem is that it's both unnecessary (you can use `this.props.color` directly instead), and creates bugs (updates to the `color` prop won't be reflected in the state).
ja: > this.state = { color: props.color }; >} >``` > >この問題はそれが不要(代わりに `this.props.color` を直接使用することができるため)であり、バグの作成につながる(`color` プロパティの更新は state に反映されないため)ことです。

source: > >**Only use this pattern if you intentionally want to ignore prop updates.
ja: > >**意図的にプロパティの更新を無視したい場合にのみ、このパターンを使用してください。

source: ** In that case, it makes sense to rename the prop to be called `initialColor` or `defaultColor`.
ja: **その場合は、プロパティの名前を `initialColor` または `defaultColor` に変更してください。

source: You can then force a component to "reset" its internal state by [changing its `key`](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key) when necessary.
ja: その後、必要に応じて[キーを変更する](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key)ことで、コンポーネントにその内部の state を「リセット」させることができます。

source: > >Read our [blog post on avoiding derived state](/blog/2018/06/07/you-probably-dont-need-derived-state.html) to learn about what to do if you think you need some state to depend on the props.
ja: > >もしあなたが props に依存する何らかの state が必要だと思うなら、どうすればいいのか学ぶために私達の[派生 state を避けることについてのブログ記事](/blog/2018/06/07/you-probably-dont-need-derived-state.html)を読んでください。

source: `componentDidMount()` is invoked immediately after a component is mounted (inserted into the tree).
ja: `componentDidMount()` は、コンポーネントがマウントされた（ツリーに挿入された）直後に呼び出されます。

source: Initialization that requires DOM nodes should go here.
ja: DOM ノードを必要とする初期化はここで行われるべきです。

source: If you need to load data from a remote endpoint, this is a good place to instantiate the network request.
ja: リモートエンドポイントからデータをロードする必要がある場合、これはネットワークリクエストを送信するのに適した場所です。

source: This method is a good place to set up any subscriptions.
ja: このメソッドは、購読を設定するのに適した場所です。

source: If you do that, don't forget to unsubscribe in `componentWillUnmount()`.
ja: 設定した場合は、`componentWillUnmount()` で購読を解除することを忘れないでください。

source: You **may call `setState()` immediately** in `componentDidMount()`.
ja: `componentDidMount()` の中で、あなたは**すぐに `setState()` を呼び出すことができます**。

source: It will trigger an extra rendering, but it will happen before the browser updates the screen.
ja: それは余分なレンダーを引き起こしますが、ブラウザが画面を更新する前に起こります。

source: This guarantees that even though the `render()` will be called twice in this case, the user won't see the intermediate state.
ja: これにより、この場合 `render()` が 2 回呼び出されても、ユーザには中間状態が表示されません。

source: Use this pattern with caution because it often causes performance issues.
ja: このパターンはパフォーマンス上の問題を引き起こすことが多いので、慎重に使用してください。

source: In most cases, you should be able to assign the initial state in the `constructor()` instead.
ja: ほとんどの場合、代わりに `constructor()` で初期状態を state に代入できるはずです。

source: It can, however, be necessary for cases like modals and tooltips when you need to measure a DOM node before rendering something that depends on its size or position.
ja: ただし、モーダルやツールチップのような場合に、サイズや位置に応じて何かをレンダーする前に DOM ノードを測定することが必要になる場合があります。

source: `componentDidUpdate()` is invoked immediately after updating occurs.
ja: 更新が行われた直後に `componentDidUpdate()` が呼び出されます。

source: This method is not called for the initial render.
ja: このメソッドは最初のレンダーでは呼び出されません。

source: Use this as an opportunity to operate on the DOM when the component has been updated.
ja: コンポーネントが更新されたときに DOM を操作する機会にこれを使用してください。

source: This is also a good place to do network requests as long as you compare the current props to previous props (e.g. a network request may not be necessary if the props have not changed).
ja: 現在の props と前の props を比較している限り、これはネットワークリクエストを行うのにも適した場所です（たとえば、props が変更されていない場合、ネットワークリクエストは必要ないかもしれません）。

source: // Typical usage (don't forget to compare props):
ja: // 典型的な使い方(props を比較することを忘れないでください)

source: You **may call `setState()` immediately** in `componentDidUpdate()` but note that **it must be wrapped in a condition** like in the example above, or you'll cause an infinite loop.
ja: `componentDidUpdate()` の中で、あなたは**すぐに `setState()` を呼び出すことができます**が、それは上記の例のような**条件でラップされなければならない**ことに注意してください。

source: It would also cause an extra re-rendering which, while not visible to the user, can affect the component performance.
ja: そうしなければ、無限ループを引き起こすでしょう。また、余分な再レンダーが発生し、ユーザには見えないものの、コンポーネントのパフォーマンスに影響を与える可能性があります。

source: If you're trying to "mirror" some state to a prop coming from above, consider using the prop directly instead.
ja: 親から来る props を何らかの state に「反映」しようとしている場合は、代わりに props を直接使用することを検討してください。

source: Read more about [why copying props into state causes bugs](/blog/2018/06/07/you-probably-dont-need-derived-state.html).
ja: [props を state にコピーするとバグが発生する理由](/blog/2018/06/07/you-probably-dont-need-derived-state.html)をよく読んでください。

source: If your component implements the `getSnapshotBeforeUpdate()` lifecycle (which is rare), the value it returns will be passed as a third "snapshot" parameter to `componentDidUpdate()`.
ja: コンポーネントが `getSnapshotBeforeUpdate()` ライフサイクルを実装している場合（これはまれです）、それが返す値は 3 番目の「スナップショット」パラメータとして `componentDidUpdate()` に渡されます。

source: Otherwise this parameter will be undefined.
ja: それ以外の場合、このパラメータは未定義になります。

source: > Note > > `componentDidUpdate()` will not be invoked if [`shouldComponentUpdate()`](#shouldcomponentupdate) returns false.
ja: > 補足 > > [`shouldComponentUpdate()`](#shouldcomponentupdate) が false を返した場合、`componentDidUpdate()` は呼び出されません。

source: `componentWillUnmount()` is invoked immediately before a component is unmounted and destroyed.
ja: `componentWillUnmount()` は、コンポーネントがアンマウントされて破棄される直前に呼び出されます。

source: Perform any necessary cleanup in this method, such as invalidating timers, canceling network requests, or cleaning up any subscriptions that were created in `componentDidMount()`.
ja: タイマーの無効化、ネットワークリクエストのキャンセル、`componentDidMount()` で作成された購読の解除など、このメソッドで必要なクリーンアップを実行します。

source: You **should not call `setState()`** in `componentWillUnmount()` because the component will never be re-rendered.
ja: コンポーネントは再レンダーされないため、`componentWillUnmount()` で **`setState()` を呼び出さないでください**。

source: Once a component instance is unmounted, it will never be mounted again.
ja: コンポーネントインスタンスがアンマウントされると、再度マウントされることはありません。

source: ### Rarely Used Lifecycle Methods {#rarely-used-lifecycle-methods}
ja: ### まれに使われるライフサイクルメソッド {#rarely-used-lifecycle-methods}

source: The methods in this section correspond to uncommon use cases.
ja: このセクションのメソッドは、一般的でないユースケースに対応しています。

source: They're handy once in a while, but most of your components probably don't need any of them.
ja: これらは時々便利に使えますが、あなたのコンポーネントのほとんどはおそらくそれらのどれも必要としないでしょう。

source: **You can see most of the methods below on [this lifecycle diagram](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/) if you click the "Show less common lifecycles" checkbox at the top of it.**
ja: **この[ライフサイクル図](https://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/)の上部にある「あまり一般的ではないライフサイクルを表示する」チェックボックスをクリックすると、以下のほとんどの方法が表示されます。**

source: Use `shouldComponentUpdate()` to let React know if a component's output is not affected by the current change in state or props.
ja: コンポーネントの出力が現在の state の変化や props の影響を受けていないかどうかを React に知らせるには `shouldComponentUpdate()` を使用します。

source: The default behavior is to re-render on every state change, and in the vast majority of cases you should rely on the default behavior.
ja: デフォルトの振る舞いはすべての状態変化を再レンダーすることです、そして大部分の場合、あなたはデフォルトの振る舞いに頼るべきです。

source: `shouldComponentUpdate()` is invoked before rendering when new props or state are being received.
ja: 新しい props または state が受け取られると、レンダーする前に `shouldComponentUpdate()` が呼び出されます。

source: Defaults to `true`.
ja: デフォルトは `true` です。

source: This method is not called for the initial render or when `forceUpdate()` is used.
ja: このメソッドは最初のレンダーや `forceUpdate()` の使用時には呼び出されません。

source: This method only exists as a **[performance optimization](/docs/optimizing-performance.html).
ja: このメソッドは[パフォーマンスの最適化](/docs/optimizing-performance.html)としてのみ存在します。

source: ** Do not rely on it to "prevent" a rendering, as this can lead to bugs.
ja: バグを引き起こす可能性があるので、レンダーを「抑止する」ためにそれを使用しないでください。

source: **Consider using the built-in [`PureComponent`](/docs/react-api.html#reactpurecomponent)** instead of writing `shouldComponentUpdate()` by hand.
ja: `shouldComponentUpdate()` を書く代わりに、**組み込みの [PureComponent](/docs/react-api.html#reactpurecomponent)** を使用することを検討してください。

source: `PureComponent` performs a shallow comparison of props and state, and reduces the chance that you'll skip a necessary update.
ja: `PureComponent` は props と state を浅く比較し、必要なアップデートをスキップする可能性を減らします。

source: If you are confident you want to write it by hand, you may compare `this.props` with `nextProps` and `this.state` with `nextState` and return `false` to tell React the update can be skipped.
ja: あなたが手でそれを書きたいと確信しているなら、あなたは `nextProps` と `this.props` または `nextState` と `this.state` を比較して、更新をスキップできることを React に伝えるために `false` を返すことができます。

source: Note that returning `false` does not prevent child components from re-rendering when *their* state changes.
ja: `false` を返しても、*子コンポーネントの* state が変化したときに子コンポーネントが再レンダーされるのを防ぐことはできません。

source: We do not recommend doing deep equality checks or using `JSON.stringify()` in `shouldComponentUpdate()`.
ja: 等価性を深く調べることや `shouldComponentUpdate()` で `JSON.stringify()` を使用することはおすすめしません。

source: It is very inefficient and will harm performance.
ja: これは非常に非効率的であり、パフォーマンスに悪影響を及ぼします。

source: Currently, if `shouldComponentUpdate()` returns `false`, then [`UNSAFE_componentWillUpdate()`](#unsafe_componentwillupdate), [`render()`](#render), and [`componentDidUpdate()`](#componentdidupdate) will not be invoked.
ja: 現在、`shouldComponentUpdate()` が `false` を返す場合、[`UNSAFE_componentWillUpdate()`](#unsafe_componentwillupdate)、[`render()`](#render)、および [`componentDidUpdate()`](#componentdidupdate) は呼び出されません。

source: In the future React may treat `shouldComponentUpdate()` as a hint rather than a strict directive, and returning `false` may still result in a re-rendering of the component.
ja: 将来的には、React は `shouldComponentUpdate()` を厳密な命令ではなくヒントとして扱うようになり、`false` を返してもコンポーネントが再レンダーされる可能性があります。

source: `getDerivedStateFromProps` is invoked right before calling the render method, both on the initial mount and on subsequent updates.
ja: `getDerivedStateFromProps` は、初期マウント時とその後の更新時の両方で、`render()` メソッドを呼び出す直前に呼び出されます。

source: It should return an object to update the state, or `null` to update nothing.
ja: state を更新するためにオブジェクトを返すか、何も更新しない場合は `null` を返すべきです。

source: This method exists for [rare use cases](/blog/2018/06/07/you-probably-dont-need-derived-state.html#when-to-use-derived-state) where the state depends on changes in props over time.
ja: このメソッドは、state が時間の経過とともに変化する props に依存するような[まれな使用例](/blog/2018/06/07/you-probably-dont-need-derived-state.html#when-to-use-derived-state)のために存在します。

source: For example, it might be handy for implementing a `<Transition>` component that compares its previous and next children to decide which of them to animate in and out.
ja: たとえば、以前と以降の子を比較してどちらの子をアニメーションするかを決定する `<Transition>` コンポーネントを実装するときに便利です。

source: Deriving state leads to verbose code and makes your components difficult to think about.
ja: state を派生させると冗長なコードにつながり、コンポーネントを考えるのが難しくなります。

source: [Make sure you're familiar with simpler alternatives:](/blog/2018/06/07/you-probably-dont-need-derived-state.html)
ja: [より簡単な方法があるのでまずそちらに慣れるようにしてください。](/blog/2018/06/07/you-probably-dont-need-derived-state.html)

source: * If you need to **perform a side effect** (for example, data fetching or an animation) in response to a change in props, use [`componentDidUpdate`](#componentdidupdate) lifecycle instead.
ja: * props の変更に応じて**副作用を実行する**必要がある場合は（データのフェッチやアニメーションなど）、代わりに [`componentDidUpdate`](#componentdidupdate) ライフサイクルを使用してください

source: * If you want to **re-compute some data only when a prop changes**, [use a memoization helper instead](/blog/2018/06/07/you-probably-dont-need-derived-state.html#what-about-memoization).
ja: * **プロパティが変更されたときにのみデータを再計算したい**場合は、[代わりにメモ化ヘルパーを使用してください](/blog/2018/06/07/you-probably-dont-need-derived-state.html#what-about-memoization)

source: * If you want to **"reset" some state when a prop changes**, consider either making a component [fully controlled](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-controlled-component) or [fully uncontrolled with a `key`](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key) instead.
ja: * **プロパティが変更されたときに何かの state を「リセット」したい**場合は、代わりにコンポーネントを[完全に制御する](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-controlled-component)か、または [`key` を使って全く制御しない](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key)かを検討してください

source: This method doesn't have access to the component instance.
ja: このメソッドはコンポーネントインスタンスにアクセスできません。

source: If you'd like, you can reuse some code between `getDerivedStateFromProps()` and the other class methods by extracting pure functions of the component props and state outside the class definition.
ja: 必要に応じて、コンポーネントの props と state の純粋な関数を抽出し、クラス定義外に記述することで、`getDerivedStateFromProps()` と他のクラスメソッドの間でコードを再利用できます。このメソッドは、原因に関係なく、*すべての*レンダーで起動されることに注意してください。

source: Note that this method is fired on *every* render, regardless of the cause.
ja: これは `UNSAFE_componentWillReceiveProps` とは対照的です。
